# Задача 1
N = 4
C1 = "a"
C2 = "b"

print((C1 + C2) * int(N/2))

print("\n\n\n*********************************\n\n\n")

# Задача 2
word = "Hello!"
print(word[::-1])

print("\n\n\n*********************************\n\n\n")

# Задача 3
line = "There are 3 HUGE buildings on this streetThere are 3 HUGE buildings on this street"
line = line.lower()

print(line)


print("\n\n\n*********************************\n\n\n")
# Задача 4 Так и не понял

# Logic:
# - проверить, является ли инпут текстом? текст - это строка с буквами ИЛИ как минимум 2 точками
# - если это текст, то сразу вывести 0, и дальше не проверять
# - если это не текст
#   - проверить, есть ли точка внутри строки
#   - если есть, то вывести 2 (для дроби)
#   - если нет, то вывести 1 (для целой)
#
array = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, ]
n = len(array)
for i in range(array):
    print(' ', array[i], ' ', array[n - i - 1])
if n % 2 != 0:
    print(' ')
